---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.Dispose
source: html/b75b6194-e36e-516c-da7e-380e6c90fcbc.htm
---
# Autodesk.Revit.DB.TableSectionData.Dispose Method

Releases all resources used by the TableSectionData

## Syntax (C#)
```csharp
public void Dispose()
```